{
    "main": {
      "name": "Pratiksha Shrestha",
      "occupation": "Software Developer",
      "description": "I enjoy working on data focused large scale projects. Sometimes I like to get my hands dirty with machine learning and blockchain. I'm currently looking for Software Engineer roles.",
      "image": "profilePic.jpg",
      "bio": [
        "I'm currently pursuing MS in Computer Science at Miami University of Ohio and plan to graduate on May 2024. I work as a Full-Stack Developer and Graduate Assistant at Myaamia Center.",
        "I have four years of experience in software development, especially in developing B2B e-commerce web applications. My expertise lies in Node.js, Python, MySQL, and Amazon Web Services (AWS). I like to keep learning. I'm currently working on my frontend development skills alongside diving into blockchain."
      ],
      "contactmessage": "You can contact me at pratiksha.shrestha97@gmail.com.",
      "email": "pratiksha.shrestha97@gmail.com",
      "phone": "+1 (347) 686 1391",
      "address": {
        "street": "714 South Locust Street",
        "city": "Oxford",
        "state": "Ohio",
        "zip": "45056"
      },
      "website": "http://pratikshashrestha.com.np",
      "resumeDownload": "/documents/Pratiksha_Shrestha_Resume_onepage.pdf",
      "social": [
        {
          "name": "facebook",
          "url": "https://www.facebook.com/pratibha.stha",
          "className": "fa fa-facebook"
        },
        {
          "name": "linkedin",
          "url": "https://www.linkedin.com/in/pratiksha-shrestha-8a5277b9/",
          "className": "fa fa-linkedin"
        },
        {
          "name": "instagram",
          "url": "https://www.instagram.com/pratisresta/",
          "className": "fa fa-instagram"
        },
        {
          "name": "github",
          "url": "https://github.com/prati1",
          "className": "fa fa-github"
        }
      ]
    },
    "research": {
      "bio": [
        "My primary research interest lies in application of blockchain technology to solve real-world problems. I'm working with Dr. Suman Bhunia at Miami University on blockchain based solution to design double blind peer review system that's fully anonymous and supports incentivization."
      ],
      "interests": ["Software Engineering", "Blockchain", "Privacy and Security", "Machine Learning"]
    },
    "resume": {
      "skillmessage": "The tech stacks I'm comfortable with:",
      "education": [
        {
          "school": "Miami University",
          "degree": "MS in Computer Science",
          "graduated": "May 2024 (Expected)",
          "description": "Courses: Machine Learning, Advanced Databases, Cryptography"
        },
        {
          "school": "Kathmandu University",
          "degree": "BE in Computer Engineering",
          "graduated": "December 2018",
          "description": "Courses: Data Structures and Algorithms, Software Engineering, Artificial Intelligence"
        }
      ],
      "work": [
        {
          "company": "Myaamia Center, Miami University, Oxford, OH",
          "title": "Full-Stack Developer (Graduate Assistant)",
          "years": "August 2022 - Present",
          "description": [
            "Designed and built intuitive web admin panel for tribal language revitalization, enhancing engagement and accessibility.",
            "Led database architecture design and development for a dynamic survey management and data analysis platform. Supported 10+ surveys, implementing advanced filtering, sorting, and data mapping across interconnected survey datasets.",
            "Developed a tool for efficient multipart uploads and streamed downloads for large files on AWS S3, effectively preventing web wait timeout issues.",
            "Migrated from traditional server to AWS cloud services with zero server downtime and data loss"
          ],
          "stack": "PHP (Laravel), jQuery, JavaScript, Python, AWS, MariaDB, Docker, Rest API, Puppet"
        },
        {
          "company": "Proshore Netherlands (via Proshore Nepal)",
          "title": "Software Developer",
          "years": "March 2019 - June 2022",
          "description": [
            "Led development of B2B web applications in cross-functional team of 7-10 members following Agile SCRUM approach",
            "Achieved 400% performance boost with targeted database optimization & codebase enhancement (5x faster response time)",
            "Implemented factory pattern with multi-threading for efficient large database parsing in Python batch jobs",
            "Optimized SQL queries, re-indexed tables, implemented client-server database model with database partitioning and sharding along with Redis cache for frequently accessed data to reduce server load and improve performance",
            "Implemented e-commerce data synchronization across 4 third-party vendor systems for improved data accuracy & efficiency",
            "Migrated legacy monolithic application to microservices model hosted in AWS EC2 using AWS Gateway API",
            "Engineered continuous deployment pipeline reducing deployment time by 70% with improved release and rollback process"
          ],
          "stack": "Node.js, Python, JavaScript, MySQL, DocumentDB, AWS, Docker, Kubernetes, Redis, jQuery, Vue.js, Knex.js, Express.js, Mollie API, REST API, Filezilla, FTP, SMTP, cXML, Jira, Postman, Selenium, Chai"
        },
        {
          "company": "GrowByData Services Pvt. Ltd.",
          "title": "Associate Software Engineer",
          "years": "August 2018 - February 2019",
          "description": [
            "Researched and implemented search engine optimization strategies resulting in increased visibility of e-commerce stores",
            "Incorporated search engine spidering, crawling, indexing and set up tests and campaigns for A/B testing and report generation",
            "Developed client-requested features on sites hosted in e-commerce platforms"
          ],
          "stack": "JavaScript, Node.js, jQuery, Shopify, BigCommerce, Magento, ABTasty, Screaming Frog, Google Tag Manager"
        }
      ],
      "skills": [
        {
          "name": "JavaScript",
          "level": "80%"
        },
        {
          "name": "Node.js",
          "level": "70%"
        },
        {
          "name": "Python",
          "level": "70%"
        },
        {
          "name": "MySQL",
          "level": "70%"
        },
        
        {
          "name": "AWS Services",
          "level": "65%"
        },
        {
          "name": "PHP",
          "level": "50%"
        },
        {
          "name": "Git",
          "level": "70%"
        },
        {
          "name": "React",
          "level": "50%"
        },
        {
          "name": "Solidity",
          "level": "50%"
        }
      ]
    },
    "portfolio": {
      "projects": [
        {
          "title": "Blinqed",
          "category": "A B2B e-commerce web application",
          "image": "blinqed.png",
          "url": "https://my.orderxl.com/login"
        },
        {
          "title": "Šaapohkaayoni",
          "category": "Education portal for Myaamia tribe to access educational opportunities.",
          "image": "eduportal.png",
          "url": "https://mc.miamioh.edu/eduportal"
        },
        {
          "title": "Eensweenkia",
          "category":"Online platform to manage surveys related to Myaamia tribal culture and language revitalization efforts.",
          "image": "eensweenkia.png",
          "url": "https://mctest.miamioh.edu/eensweenkia/"
        },
        {
          "title": "Eduawards",
          "category":"Online platform to apply for scholorship opportunities",
          "image": "eduawards.png",
          "url": "https://mc.miamioh.edu/edu-awards/"
        }
      ]
    }
  }
